local Logger = require("util.logger")

local Memory = {}

function Memory.init()

    storage.ai = storage.ai or {

        version = "0.2.0",

        ----------------------------------------------------
        -- Состояние ИИ
        ----------------------------------------------------

        state = "idle",

        ----------------------------------------------------
        -- Игрок
        ----------------------------------------------------

        player = {

            position = nil,
            inventory = {},
            health = 100,
            direction = nil

        },

        ----------------------------------------------------
        -- Цель
        ----------------------------------------------------

        target = {

            entity = nil,
            position = nil,
            type = nil

        },

        ----------------------------------------------------
        -- Мир
        ----------------------------------------------------

        world = {

            iron = nil,
            copper = nil,
            coal = nil,
            stone = nil

        },

        ----------------------------------------------------
        -- Мысли ИИ
        ----------------------------------------------------

        thought = "idle",

        ----------------------------------------------------
        -- Текущая задача
        ----------------------------------------------------

        task = nil

    }

    Logger.info("Memory initialized")

end

return Memory